@tombuildsstuff  all depends_on does is ensures the dependent resource is built in proper order. the marketplace agreement completed before the VM was created so - no, depends_on would not fix it. see below. in every example ive shown the marketplace resource was built first

here is a run where i set `depends_on` explicitly, even though it doesnt matter at all in every circumstance above. the resource **does not work**

```
Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.tc1 is tainted, so must be replaced
-/+ resource "azurerm_linux_virtual_machine" "tc1" {
      ~ id                              = "/subscriptions/<>/resourceGroups/acme-dev/providers/Microsoft.Compute/virtualMachines/tomcat" -> (known after apply)
        name                            = "tomcat"
      ~ private_ip_address              = "10.0.0.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.0.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
        tags                            = {
            "acme-all" = "true"
            "admin"    = "yes"
            "app"      = "tomcat"
        }
      ~ virtual_machine_id              = "67914474-f480-410f-9e49-18ee6a40c9eb" -> (known after apply)
        # (15 unchanged attributes hidden)


      ~ boot_diagnostics {}

      ~ os_disk {
            name                      = "tomcat"
            # (4 unchanged attributes hidden)
        }



        # (4 unchanged blocks hidden)
    }

  # azurerm_marketplace_agreement.tomcat is tainted, so must be replaced
-/+ resource "azurerm_marketplace_agreement" "tomcat" {
      ~ id                  = "/subscriptions/<>/providers/Microsoft.MarketplaceOrdering/agreements/bitnami/offers/tom-cat/plans/hourly" -> (known after apply)
      ~ license_text_link   = "https://mpcprodsa.blob.core.windows.net/legalterms/3E5ED_legalterms_BITNAMI%253a24TOM%253a2DCAT%253a24HOURLY%253a24TUHRPTBFUGCFZ7MYDV5YYPIWHN26Z4EG25KVSJP4ICXU6QHBC6MM2RIWDMKPZN7GE5Z43UNM3JLUYIGL6PPEHFCDIYYYPZFBXMWBNCA.txt" -> (known after apply)
      ~ privacy_policy_link = "https://www.vmware.com/help/privacy.html" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_network_interface.tc1 will be updated in-place
  ~ resource "azurerm_network_interface" "tc1" {
        id                            = "/subscriptions/<>/resourceGroups/acme-dev/providers/Microsoft.Network/networkInterfaces/tomcat-1314"
        name                          = "tomcat-1314"
        tags                          = {
            "admin" = "yes"
            "app"   = "tomcat"
        }
        # (11 unchanged attributes hidden)

      ~ ip_configuration {
            name                          = "ipconfig1"
          ~ private_ip_address            = "10.0.0.4" -> "10.0.0.5"
            # (4 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_linux_virtual_machine.tc1: Destroying... [id=/subscriptions/<>/resourceGroups/acme-dev/providers/Microsoft.Compute/virtualMachines/tomcat]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 10s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 20s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 30s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 40s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 50s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 1m0s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 1m10s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 1m20s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 1m30s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 1m40s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 1m50s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 2m0s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 2m10s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 2m20s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 2m30s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 2m40s elapsed]
azurerm_linux_virtual_machine.tc1: Still destroying... [id=/subscriptions/8f6ea36f-48a4-4bc6-aaf1-...crosoft.Compute/virtualMachines/tomcat, 2m50s elapsed]
azurerm_linux_virtual_machine.tc1: Destruction complete after 2m53s
azurerm_marketplace_agreement.tomcat: Destroying... [id=/subscriptions/<>/providers/Microsoft.MarketplaceOrdering/agreements/bitnami/offers/tom-cat/plans/hourly]
azurerm_network_interface.tc1: Modifying... [id=/subscriptions/<>/resourceGroups/acme-dev/providers/Microsoft.Network/networkInterfaces/tomcat-1314]
azurerm_network_interface.tc1: Modifications complete after 2s [id=/subscriptions/<>/resourceGroups/acme-dev/providers/Microsoft.Network/networkInterfaces/tomcat-1314]
azurerm_marketplace_agreement.tomcat: Destruction complete after 2s
azurerm_marketplace_agreement.tomcat: Creating...
azurerm_marketplace_agreement.tomcat: Creation complete after 5s [id=/subscriptions/<>/providers/Microsoft.MarketplaceOrdering/agreements/bitnami/offers/tom-cat/plans/hourly]
azurerm_linux_virtual_machine.tc1: Creating...
╷
│ Error: creating Linux Virtual Machine "tomcat" (Resource Group "acme-dev"): compute.VirtualMachinesClient#CreateOrUpdate: Failure sending request: StatusCode=0 -- Original Error: Code="ResourcePurchaseValidationFailed" Message="User failed validation to purchase resources. Error message: 'You have not accepted the legal terms on this subscription: '<>' for this plan. Before the subscription can be used, you need to accept the legal terms of the image. To read and accept legal terms, use the Azure CLI commands described at https://go.microsoft.com/fwlink/?linkid=2110637 or the PowerShell commands available at https://go.microsoft.com/fwlink/?linkid=862451. Alternatively, deploying via the Azure portal provides a UI experience for reading and accepting the legal terms. Offer details: publisher='bitnami' offer = 'tom-cat', sku = '7-0', Correlation Id: '9b2358ad-74b1-778f-4b16-fae2a234fb33'.'"
│
│   with azurerm_linux_virtual_machine.tc1,
│   on vm_test_tomcat.tf line 65, in resource "azurerm_linux_virtual_machine" "tc1":
│   65: resource "azurerm_linux_virtual_machine" "tc1" {
```